Laur59/uKOS-X-IWYU/Ports/Targets/MAiXDUiNO_K210/Base/Lib_peripherals/imgk/imgk.c
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 * SPDX-FileCopyrightText: 2025-2026 Laurent von Allmen
 *
 * Goal:     imgk manager.
 */

#include    "imgk.h"
#include    "OV2640.h"

#include    <math.h>
#include    <stdint.h>
#include    <stdlib.h>

#include    "Registers/K210_dvp.h"
#include    "Registers/K210_plic.h"
#include    "Registers/soc_vectors.h"
#include    "clockTree.h"
#include    "kern/kern.h"
#include    "macros.h"
#include    "macros_core.h"
#include    "macros_soc.h"
#include    "memo/memo.h"
#include    "modules.h"
#include    "os_errors.h"
#include    "record/record.h"
#include    "types.h"

static              uint16_t    *vImageE0 = nullptr;
static              uint16_t    *vImageE1 = nullptr;
static              sema_t      *vSeHandleAQ;
static              sema_t      *vSeHandleIM;
static              mutx_t      *vMutex;
static  volatile    uint8_t     vPage = 1U;

// uKOS-X specific (see the module.h)
// ==================================

// ----------------------------------I------------I-----------------------------------------I--------------I

STRG_LOC_CONST(aStrApplication[]) = "imgk         imgk manager.                             (c) EFr-2026";
STRG_LOC_CONST(aStrHelp[])        = "imgk manager\n"
                                    "============\n\n"

                                    "This manager ...\n\n"

                                    "Module built on "__DATE__"  "__TIME__" (c) EFr-2026\n\n";

MODULE(
    Imgk,                           // Module name (the first letter has to be upper case)
    KID_FAM_PERIPHERALS,            // Family (defined in the module.h)
    KIMGK_NUM,                      // Module identifier (defined in the module.h)
    nullptr,                        // Address of the initialisation code (early pre-init)
    nullptr,                        // Address of the code (prgm for tools, aStart for applications, nullptr for libraries)
    nullptr,                        // Address of the clean code (clean the module)
    " 1.0",                         // Revision string (major . minor)
    (1U<<BSHOW),                    // Flags (BSHOW = visible with "man", BEXE_CONSOLE = executable, BCONFIDENTIAL = hidden)
    0                               // Execution cores
);

// Library specific
// ================

// See tables 12-13 of the OV2640
// Initialisation table proposed in the document OV2640 Camera Module
// Software Application Note, chapter 13.2 RGB 565 Referce setting
// Mclk = 24-MHz, SVGA RGB565, output 25-fps

static  const   ov2640_t    aOV2640_Cnf[] = {
                                { 0xFFU, 0x01U },
                                { 0x12U, 0x80U },
                                { 0xFFU, 0x00U },
                                { 0x2CU, 0xFFU },
                                { 0x2EU, 0xDFU },
                                { 0xFFU, 0x01U },
                                { 0x3CU, 0x32U },
                                { 0x11U, 0x00U },
                                { 0x09U, 0x02U },
                                { 0x04U, 0x28U },
                                { 0x13U, 0xE5U },
                                { 0x14U, 0x48U },
                                { 0x2CU, 0x0CU },
                                { 0x33U, 0x78U },
                                { 0x3AU, 0x33U },
                                { 0x3BU, 0xFBU },
                                { 0x3EU, 0x00U },
                                { 0x43U, 0x11U },
                                { 0x16U, 0x10U },
                                { 0x39U, 0x92U },
                                { 0x35U, 0xDAU },
                                { 0x22U, 0x1AU },
                                { 0x37U, 0xC3U },
                                { 0x23U, 0x00U },
                                { 0x34U, 0xC0U },
                                { 0x36U, 0x1AU },
                                { 0x06U, 0x88U },
                                { 0x07U, 0xC0U },
                                { 0x0DU, 0x87U },
                                { 0x0EU, 0x41U },
                                { 0x4CU, 0x00U },
                                { 0x48U, 0x00U },
                                { 0x5BU, 0x00U },
                                { 0x42U, 0x03U },
                                { 0x4AU, 0x81U },
                                { 0x21U, 0x99U },
                                { 0x24U, 0x40U },
                                { 0x25U, 0x38U },
                                { 0x26U, 0x82U },
                                { 0x5CU, 0x00U },
                                { 0x63U, 0x00U },
                                { 0x46U, 0x22U },
                                { 0x0CU, 0x3CU },
                                { 0x61U, 0x70U },
                                { 0x62U, 0x80U },
                                { 0x7CU, 0x05U },
                                { 0x20U, 0x80U },
                                { 0x28U, 0x30U },
                                { 0x6CU, 0x00U },
                                { 0x6DU, 0x80U },
                                { 0x6EU, 0x00U },
                                { 0x70U, 0x02U },
                                { 0x71U, 0x94U },
                                { 0x73U, 0xC1U },
                                { 0x12U, 0x40U },
                                { 0x17U, 0x11U },
                                { 0x18U, 0x43U },
                                { 0x19U, 0x00U },
                                { 0x1AU, 0x4BU },
                                { 0x32U, 0x09U },
                                { 0x37U, 0xC0U },
                                { 0x4FU, 0xCAU },
                                { 0x50U, 0xA8U },
                                { 0x5AU, 0x23U },
                                { 0x6DU, 0x00U },
                                { 0x3DU, 0x38U },
                                { 0xFFU, 0x00U },
                                { 0xE5U, 0x7FU },
                                { 0xF9U, 0xC0U },
                                { 0x41U, 0x24U },
                                { 0xE0U, 0x14U },
                                { 0x76U, 0xFFU },
                                { 0x33U, 0xA0U },
                                { 0x42U, 0x20U },
                                { 0x43U, 0x18U },
                                { 0x4CU, 0x00U },
                                { 0x87U, 0xD5U },
                                { 0x88U, 0x3FU },
                                { 0xD7U, 0x03U },
                                { 0xD9U, 0x10U },
                                { 0xD3U, 0x82U },
                                { 0xC8U, 0x08U },
                                { 0xC9U, 0x80U },
                                { 0x7CU, 0x00U },
                                { 0x7DU, 0x00U },
                                { 0x7CU, 0x03U },
                                { 0x7DU, 0x48U },
                                { 0x7DU, 0x48U },
                                { 0x7CU, 0x08U },
                                { 0x7DU, 0x20U },
                                { 0x7DU, 0x10U },
                                { 0x7DU, 0x0EU },
                                { 0x90U, 0x00U },
                                { 0x91U, 0x0EU },
                                { 0x91U, 0x1AU },
                                { 0x91U, 0x31U },
                                { 0x91U, 0x5AU },
                                { 0x91U, 0x69U },
                                { 0x91U, 0x75U },
                                { 0x91U, 0x7EU },
                                { 0x91U, 0x88U },
                                { 0x91U, 0x8FU },
                                { 0x91U, 0x96U },
                                { 0x91U, 0xA3U },
                                { 0x91U, 0xAFU },
                                { 0x91U, 0xC4U },
                                { 0x91U, 0xD7U },
                                { 0x91U, 0xE8U },
                                { 0x91U, 0x20U },
                                { 0x92U, 0x00U },
                                { 0x93U, 0x06U },
                                { 0x93U, 0xE3U },
                                { 0x93U, 0x05U },
                                { 0x93U, 0x05U },
                                { 0x93U, 0x00U },
                                { 0x93U, 0x04U },
                                { 0x93U, 0x00U },
                                { 0x93U, 0x00U },
                                { 0x93U, 0x00U },
                                { 0x93U, 0x00U },
                                { 0x93U, 0x00U },
                                { 0x93U, 0x00U },
                                { 0x93U, 0x00U },
                                { 0x96U, 0x00U },
                                { 0x97U, 0x08U },
                                { 0x97U, 0x19U },
                                { 0x97U, 0x02U },
                                { 0x97U, 0x0CU },
                                { 0x97U, 0x24U },
                                { 0x97U, 0x30U },
                                { 0x97U, 0x28U },
                                { 0x97U, 0x26U },
                                { 0x97U, 0x02U },
                                { 0x97U, 0x98U },
                                { 0x97U, 0x80U },
                                { 0x97U, 0x00U },
                                { 0x97U, 0x00U },
                                { 0xC3U, 0xEDU },
                                { 0xA4U, 0x00U },
                                { 0xA8U, 0x00U },
                                { 0xC5U, 0x11U },
                                { 0xC6U, 0x51U },
                                { 0xBFU, 0x80U },
                                { 0xC7U, 0x10U },
                                { 0xB6U, 0x66U },
                                { 0xB8U, 0xA5U },
                                { 0xB7U, 0x64U },
                                { 0xB9U, 0x7CU },
                                { 0xB3U, 0xAFU },
                                { 0xB4U, 0x97U },
                                { 0xB5U, 0xFFU },
                                { 0xB0U, 0xC5U },
                                { 0xB1U, 0x94U },
                                { 0xB2U, 0x0FU },
                                { 0xC4U, 0x5CU },
                                { 0xC0U, 0x64U },
                                { 0xC1U, 0x4BU },
                                { 0x8CU, 0x00U },
                                { 0x86U, 0x3DU },
                                { 0x50U, 0x00U },
                                { 0x51U, 0xC8U },
                                { 0x52U, 0x96U },
                                { 0x53U, 0x00U },
                                { 0x54U, 0x00U },
                                { 0x55U, 0x00U },
                                { 0x5AU, 0xC8U },
                                { 0x5BU, 0x96U },
                                { 0x5CU, 0x00U },
                                { 0xD3U, 0x82U },
                                { 0xC3U, 0xEDU },
                                { 0x7FU, 0x00U },
                                { 0xDAU, 0x08U },
                                { 0xE5U, 0x1FU },
                                { 0xE1U, 0x67U },
                                { 0xE0U, 0x00U },
                                { 0xDDU, 0x7FU },
                                { 0x05U, 0x00U }
                            };

#define KNBCNF      (sizeof(aOV2640_Cnf) / sizeof(ov2640_t))

// Prototypes

static  int32_t local_init(void);
static  void    local_initCKRate(const cnfImgk_t *configure);
static  void    local_initImages(const cnfImgk_t *configure);
static  void    local_initOV2640(const cnfImgk_t *configure);
static  void    local_DVP_IRQHandler(uint32_t core, uint64_t parameter);

