Laur59/uKOS-X-IWYU/Ports/Targets/MAiXDUiNO_K210/Base/Lib_peripherals/imgk/imgk.c
/*
 * \brief Reserve the imgk manager
 *
 * Call example in C:
 *
 * \code{.c}
 * int32_t    status;
 *
 *    status = imgk_reserve(KMODE_READ_WRITE, 1234);
 *    ....
 *    imgk_xyz();
 *    ....
 *    status = imgk_release(KMODE_READ_WRITE);
 * \endcode
 *
 * \param[in]   reserveMode     Any mode
 * \param[in]   timeout         Timeout (1-ms of resolution)
 * \return      KERR_IMGK_NOERR The manager is reserved
 * \return      KERR_IMGK_GEERR General error
 * \return      KERR_IMGK_CHBSY The manager is busy
 *
 */
int32_t imgk_reserve(reserveMode_t reserveMode, uint32_t timeout) {
    int32_t     status;

    UNUSED(reserveMode);

    status = local_init();
    if (status != KERR_IMGK_NOERR) { return status; }

    status = kern_lockMutex(vMutex, timeout);
    if (status != KERR_IMGK_NOERR) {
        return KERR_IMGK_CHBSY;
    }
    return KERR_IMGK_NOERR;
}

/*!
 * \brief Release the imgk manager
 *
 * Call example in C:
 *
 * \code{.c}
 * int32_t    status;
 *
 *    status = imgk_release(KMODE_READ_WRITE);
 * \endcode
 *
 * \param[in]   reserveMode     Any mode
 * \return      KERR_IMGK_NOERR OK
 * \return      KERR_IMGK_GEERR General error
 * \return      KERR_IMGK_CAREL Cannot release the manager
 *
 */
int32_t imgk_release(reserveMode_t reserveMode) {
    int32_t     status;

    UNUSED(reserveMode);

    status = local_init();
    if (status != KERR_IMGK_NOERR) { return status; }

    status = kern_unlockMutex(vMutex);
    if (status != KERR_IMGK_NOERR) {
        return KERR_IMGK_CAREL;
    }
    return KERR_IMGK_NOERR;
}

/*
 * \brief Configure the imgk manager
 *
 * Call example in C:
 *
 * \code{.c}
 * // Example of table concerns the OV2640 imager
 * // See tables 12-13 of the OV2640
 * // Initialisation table proposed in the document OV2640 Camera Module
 * // Software Application Note, chapter 13.2 RGB 565 Referce setting
 * // Mclk = 24-MHz, SVGA RGB565, output 25-fps
 *
 * static    const    ov2640_t    aOV2640_Cnf[] = {
 *                                      { 0xFF, 0x01 }, { 0x12, 0x80 }, { 0xFF, 0x00 }, { 0x2C, 0xFF }, { 0x2E, 0xDF }, { 0xFF, 0x01 }, { 0x3C, 0x32 }, { 0x11, 0x00 },
 *                                      { 0x09, 0x02 }, { 0x04, 0x28 }, { 0x13, 0xE5 }, { 0x14, 0x48 }, { 0x2C, 0x0C }, { 0x33, 0x78 }, { 0x3A, 0x33 }, { 0x3B, 0xFB },
 *                                      { 0x3E, 0x00 }, { 0x43, 0x11 }, { 0x16, 0x10 }, { 0x39, 0x92 }, { 0x35, 0xDA }, { 0x22, 0x1A }, { 0x37, 0xC3 }, { 0x23, 0x00 },
 *                                      { 0x34, 0xC0 }, { 0x36, 0x1A }, { 0x06, 0x88 }, { 0x07, 0xC0 }, { 0x0D, 0x87 }, { 0x0E, 0x41 }, { 0x4C, 0x00 }, { 0x48, 0x00 },
 *                                      { 0x5B, 0x00 }, { 0x42, 0x03 }, { 0x4A, 0x81 }, { 0x21, 0x99 }, { 0x24, 0x40 }, { 0x25, 0x38 }, { 0x26, 0x82 }, { 0x5C, 0x00 },
 *                                      { 0x63, 0x00 }, { 0x46, 0x22 }, { 0x0C, 0x3C }, { 0x61, 0x70 }, { 0x62, 0x80 }, { 0x7C, 0x05 }, { 0x20, 0x80 }, { 0x28, 0x30 },
 *                                      { 0x6C, 0x00 }, { 0x6D, 0x80 }, { 0x6E, 0x00 }, { 0x70, 0x02 }, { 0x71, 0x94 }, { 0x73, 0xC1 }, { 0x12, 0x40 }, { 0x17, 0x11 },
 *                                      { 0x18, 0x43 }, { 0x19, 0x00 }, { 0x1A, 0x4B }, { 0x32, 0x09 }, { 0x37, 0xC0 }, { 0x4F, 0xCA }, { 0x50, 0xA8 }, { 0x5A, 0x23 },
 *                                      { 0x6D, 0x00 }, { 0x3D, 0x38 }, { 0xFF, 0x00 }, { 0xE5, 0x7F }, { 0xF9, 0xC0 }, { 0x41, 0x24 }, { 0xE0, 0x14 }, { 0x76, 0xFF },
 *                                      { 0x33, 0xA0 }, { 0x42, 0x20 }, { 0x43, 0x18 }, { 0x4C, 0x00 }, { 0x87, 0xD5 }, { 0x88, 0x3F }, { 0xD7, 0x03 }, { 0xD9, 0x10 },
 *                                      { 0xD3, 0x82 }, { 0xC8, 0x08 }, { 0xC9, 0x80 }, { 0x7C, 0x00 }, { 0x7D, 0x00 }, { 0x7C, 0x03 }, { 0x7D, 0x48 }, { 0x7D, 0x48 },
 *                                      { 0x7C, 0x08 }, { 0x7D, 0x20 }, { 0x7D, 0x10 }, { 0x7D, 0x0E }, { 0x90, 0x00 }, { 0x91, 0x0E }, { 0x91, 0x1A }, { 0x91, 0x31 },
 *                                      { 0x91, 0x5A }, { 0x91, 0x69 }, { 0x91, 0x75 }, { 0x91, 0x7E }, { 0x91, 0x88 }, { 0x91, 0x8F }, { 0x91, 0x96 }, { 0x91, 0xA3 },
 *                                      { 0x91, 0xAF }, { 0x91, 0xC4 }, { 0x91, 0xD7 }, { 0x91, 0xE8 }, { 0x91, 0x20 }, { 0x92, 0x00 }, { 0x93, 0x06 }, { 0x93, 0xE3 },
 *                                      { 0x93, 0x05 }, { 0x93, 0x05 }, { 0x93, 0x00 }, { 0x93, 0x04 }, { 0x93, 0x00 }, { 0x93, 0x00 }, { 0x93, 0x00 }, { 0x93, 0x00 },
 *                                      { 0x93, 0x00 }, { 0x93, 0x00 }, { 0x93, 0x00 }, { 0x96, 0x00 }, { 0x97, 0x08 }, { 0x97, 0x19 }, { 0x97, 0x02 }, { 0x97, 0x0C },
 *                                      { 0x97, 0x24 }, { 0x97, 0x30 }, { 0x97, 0x28 }, { 0x97, 0x26 }, { 0x97, 0x02 }, { 0x97, 0x98 }, { 0x97, 0x80 }, { 0x97, 0x00 },
 *                                      { 0x97, 0x00 }, { 0xC3, 0xED }, { 0xA4, 0x00 }, { 0xA8, 0x00 }, { 0xC5, 0x11 }, { 0xC6, 0x51 }, { 0xBF, 0x80 }, { 0xC7, 0x10 },
 *                                      { 0xB6, 0x66 }, { 0xB8, 0xA5 }, { 0xB7, 0x64 }, { 0xB9, 0x7C }, { 0xB3, 0xAF }, { 0xB4, 0x97 }, { 0xB5, 0xFF }, { 0xB0, 0xC5 },
 *                                      { 0xB1, 0x94 }, { 0xB2, 0x0F }, { 0xC4, 0x5C }, { 0xC0, 0x64 }, { 0xC1, 0x4B }, { 0x8C, 0x00 }, { 0x86, 0x3D }, { 0x50, 0x00 },
 *                                      { 0x51, 0xC8 }, { 0x52, 0x96 }, { 0x53, 0x00 }, { 0x54, 0x00 }, { 0x55, 0x00 }, { 0x5A, 0xC8 }, { 0x5B, 0x96 }, { 0x5C, 0x00 },
 *                                      { 0xD3, 0x82 }, { 0xC3, 0xED }, { 0x7F, 0x00 }, { 0xDA, 0x08 }, { 0xE5, 0x1F }, { 0xE1, 0x67 }, { 0xE0, 0x00 }, { 0xDD, 0x7F },
 *                                      { 0x05, 0x00 }
 *                                 };
 *
 * int32_t    status;
 * const      cnfImgk_t    configure = {
 *                             .oPixMode  = PIX8BITS;
 *                             .oNbRows   = 60;
 *                             .oNbCols   = 60;
 *                         };
 *
 *    status = imgk_configure(&configure);
 *
 * static    void    _myRoutine(void) {
 *
 * }
 * \endcode
 *
 * \param[in]   *configure      Ptr on the configuration buffer
 * \return      KERR_IMGK_NOERR OK
 * \return      KERR_IMGK_GEERR General error
 * \return      KERR_IMGK_TIMEO Timeout error
 * \return      KERR_IMGK_NOMEM Not enough memory
 *
 */
int32_t imgk_configure(const cnfImgk_t *configure) {
    uint32_t    current;
    int32_t     status = KERR_IMGK_NOERR;

