Laur59/uKOS-X-IWYU/Ports/Targets/MAiXDUiNO_K210/Base/Lib_peripherals/imgk/imgk.c
    UNUSED(configure);

    status = local_init();
    if (status != KERR_IMGK_NOERR) { return status; }

// Set the format

    current = dvp->dvp_cfg & (~DVP_CFG_FORMAT_MASK);
    dvp->dvp_cfg = current | DVP_CFG_RGB_FORMAT;

// Set the size

    current  = dvp->dvp_cfg & ~(DVP_CFG_HREF_BURST_NUM_MASK | DVP_CFG_LINE_NUM_MASK);
    current |= DVP_CFG_LINE_NUM(KIMAGER_NB_ROWS_QVGA);

    current |= ((dvp->dvp_cfg & DVP_CFG_BURST_SIZE_4BEATS) != 0U) ? (DVP_CFG_HREF_BURST_NUM(KIMAGER_NB_COLS_QVGA / 8U / 4U)) : (DVP_CFG_HREF_BURST_NUM(KIMAGER_NB_COLS_QVGA / 8 / 1));
    dvp->dvp_cfg = current;

// Reserve the memory

    if (vImageE0 != nullptr) { memo_free(vImageE0); }
    if (vImageE1 != nullptr) { memo_free(vImageE1); }

    vPage     = 1U;
    vImageE0  = (uint16_t *)memo_malloc(KMEMO_ALIGN_8, ((size_t)KIMAGER_NB_COLS_QVGA * (size_t)KIMAGER_NB_ROWS_QVGA * sizeof(uint16_t)), "imgk");
    vImageE1  = (uint16_t *)memo_malloc(KMEMO_ALIGN_8, ((size_t)KIMAGER_NB_COLS_QVGA * (size_t)KIMAGER_NB_ROWS_QVGA * sizeof(uint16_t)), "imgk");
    if (vImageE0 == nullptr) { status = KERR_IMGK_NOMEM; }
    if (vImageE1 == nullptr) { status = KERR_IMGK_NOMEM; }

    dvp->rgb_addr = (uint32_t)((uintptr_t)vImageE0);
    return status;
}

/*
 * \brief Acquisition of an image
 *
 * Call example in C:
 *
 * \code{.c}
 * int32_t    status;
 *
 *    status = imgk_acquisition();
 * \endcode
 *
 * \param[in]   -
 * \return      KERR_IMGK_NOERR OK
 * \return      KERR_IMGK_GEERR General error
 * \return      KERR_IMGK_TIMEO Timeout error
 *
 */
int32_t imgk_acquisition(void) {
    int32_t     status;

    status = local_init();
    if (status != KERR_IMGK_NOERR) { return status; }

    kern_signalSemaphore(vSemaphore_AQ);
    return KERR_IMGK_NOERR;
}

/*
 * \brief Get the image pointer
 *
 * Call example in C:
 *
 * \code{.c}
 * int32_t    status;
 * uint8_t    *image;
 *
 *    status = imgk_getImage(&image);
 * \endcode
 *
 * \param[out]  **image         Ptr on the image
 * \return      KERR_IMGK_NOERR OK
 * \return      KERR_IMGK_GEERR General error
 *
 */
int32_t imgk_getImage(volatile void **image) {
    int32_t     status;

    status = local_init();
    if (status != KERR_IMGK_NOERR) { return status; }

    if (vPage == 0U) { *image = vImageE0; return KERR_IMGK_NOERR; }
                     { *image = vImageE1; return KERR_IMGK_NOERR; }
}

// Local routines
// ==============

/*
 * \brief local_DVP_IRQHandler
 *
 * - Interruption end of acquisition
 *
 */
void    local_DVP_IRQHandler(uint32_t core, uint64_t parameter) {

// End-of-Frame interruption

    if ((dvp->sts & DVP_STS_FRAME_FINISH) != 0U) {
        if (vPage == 0U) { dvp->rgb_addr = (uint32_t)((uintptr_t)vImageE0); vPage = 1U; }
        else             { dvp->rgb_addr = (uint32_t)((uintptr_t)vImageE1); vPage = 0U; }

        kern_signalSemaphore(vSemaphore_IM);
        dvp->sts = DVP_STS_FRAME_FINISH | DVP_STS_FRAME_FINISH_WE;
    }

// End-of-Start interruption
// Synchronize the end acquisition with the
// interruption End-of-Start

    if ((dvp->sts & DVP_STS_FRAME_START) != 0U) {
        if (kern_waitSemaphore(vSemaphore_AQ, 0U) == KERR_KERN_NOERR) {
            dvp->sts = DVP_STS_DVP_EN | DVP_STS_DVP_EN_WE;
        }
        dvp->sts = DVP_STS_FRAME_START | DVP_STS_FRAME_START_WE;
    }

    plic->targets.target[core].claim_complete = (uint32_t)parameter;
}

/*
 * \brief local_init
 *
 * - This function initialises the manager and
 *   has to be called at least once
 *
 */
static  int32_t local_init(void) {
            uint32_t    core, current;
    static  bool        vInit = false;

    INTERRUPTION_OFF;
    if (!vInit) {
        vInit = true;

        if (kern_createMutex(KIMGK_MUTEX_RESERVE, &vMutex)                 != KERR_KERN_NOERR) { LOG(KFATAL_MANAGER, "imgk: create mutx"); exit(EXIT_OS_PANIC); }
        if (kern_createSemaphore(KIMGK_SEMAPHORE_IM, 0, 1, &vSemaphore_IM) != KERR_KERN_NOERR) { LOG(KFATAL_MANAGER, "imgk: create sema"); exit(EXIT_OS_PANIC); }
        if (kern_createSemaphore(KIMGK_SEMAPHORE_AQ, 0, 1, &vSemaphore_AQ) != KERR_KERN_NOERR) { LOG(KFATAL_MANAGER, "imgk: create sema"); exit(EXIT_OS_PANIC); }

// Set the priority
// Get current enable bit array by IRQ number
// Set enable bit in enable bit array
// Write back the enable bit array

        core = GET_RUNNING_CORE;
        EXT_INTERRUPT_VECTOR(EINT_DVP_INTERRUPT, local_DVP_IRQHandler);

        plic->source_priorities.priority[EINT_DVP_INTERRUPT] = (uint32_t)KINT_LEVEL_PERIPHERALS;
        current  = plic->target_enables.target[core].enable[(uint32_t)EINT_DVP_INTERRUPT / 32U];
        current |= (uint32_t)(1U<<((uint32_t)EINT_DVP_INTERRUPT % 32U));
        plic->target_enables.target[core].enable[(uint32_t)EINT_DVP_INTERRUPT / 32U] = current;

// Initialise the DVP
// Initialise the clock rate
// Initialise the image

        local_initCKRate(nullptr);
        local_initImages(nullptr);
        local_initOV2640(nullptr);

        dvp->dvp_cfg &= ~DVP_CFG_AUTO_ENABLE;
        dvp->dvp_cfg |= DVP_CFG_START_INT_ENABLE | DVP_CFG_FINISH_INT_ENABLE;
    }
    RETURN_INT_RESTORE(KERR_IMGK_NOERR);
}

/*
 * \brief local_initCKRate
 *
 * - Initialise the clock rate
 *
 */
static  void    local_initCKRate(const cnfImgk_t *configure) {
    uint32_t    period;
    uint32_t    current;

    UNUSED(configure);

// Clock devided by 16, and clock enable

    dvp->cmos_cfg &= ~DVP_CMOS_CLK_DIV_MASK;
    dvp->cmos_cfg |= DVP_CMOS_CLK_DIV(3U) | DVP_CMOS_CLK_ENABLE;

// APB clock / 255

    current  = dvp->sccb_cfg & ~(DVP_SCCB_SCL_LCNT_MASK | DVP_SCCB_SCL_HCNT_MASK);
    current |= DVP_SCCB_SCL_LCNT(255U) | DVP_SCCB_SCL_HCNT(255U);
    dvp->sccb_cfg = current;

// Set the imager clock period
// Clock devided by KFREQUENCY_APB1 / (24000000 * 2.0), and clock enable

    period = (uint32_t)round(KFREQUENCY_APB1 / (24000000 * 2.0)) - 1;
    period = (period > 255U) ? 255U : period;

    dvp->cmos_cfg &= ~DVP_CMOS_CLK_DIV_MASK;
    dvp->cmos_cfg |= DVP_CMOS_CLK_DIV(period) | DVP_CMOS_CLK_ENABLE;

