Laur59/uKOS-X-IWYU/Ports/Targets/MAiXDUiNO_K210/Base/Lib_peripherals/imgk/imgk.c
// Power-on the cmos imager

    dvp->cmos_cfg |= DVP_CMOS_POWER_DOWN;
    kern_suspendProcess(200U);
    dvp->cmos_cfg &= ~DVP_CMOS_POWER_DOWN;
    kern_suspendProcess(200U);
    dvp->cmos_cfg &= ~DVP_CMOS_RESET;
    kern_suspendProcess(200U);
    dvp->cmos_cfg |= DVP_CMOS_RESET;
    kern_suspendProcess(200U);

// Enable the burst
// Set the output enable

    dvp->dvp_cfg |= DVP_CFG_BURST_SIZE_4BEATS;
    dvp->axi     &= (~DVP_AXI_GM_MLEN_MASK);
    dvp->axi     |= DVP_AXI_GM_MLEN_4BYTE;

//  dvp->dvp_cfg |= DVP_CFG_AI_OUTPUT_ENABLE;
    dvp->dvp_cfg |= DVP_CFG_DISPLAY_OUTPUT_ENABLE;
}

/*
 * \brief local_initImages
 *
 * - Initialise the image forrmats
 *
 */
static  void    local_initImages(const cnfImgk_t *configure) {
    uint32_t    current;

    UNUSED(configure);

// Set the format

    current = dvp->dvp_cfg & (~DVP_CFG_FORMAT_MASK);
    dvp->dvp_cfg = current | DVP_CFG_RGB_FORMAT;

// Set the size

    current = dvp->dvp_cfg & ~(DVP_CFG_HREF_BURST_NUM_MASK | DVP_CFG_LINE_NUM_MASK);
    current |= DVP_CFG_LINE_NUM(KIMAGER_NB_ROWS_QVGA);

    current |= ((dvp->dvp_cfg & DVP_CFG_BURST_SIZE_4BEATS) != 0U) ? (DVP_CFG_HREF_BURST_NUM(KIMAGER_NB_COLS_QVGA / 8U / 4U)) : (DVP_CFG_HREF_BURST_NUM(KIMAGER_NB_COLS_QVGA / 8 / 1));
    dvp->dvp_cfg = current;
}

/*
 * \brief local_initOV2640
 *
 * - Initialise the OV2640 (8-bit transfer)
 *
 */
static  void    local_sendData(uint8_t address, uint16_t location, uint8_t data) {
    uint32_t    current;

    current  = dvp->sccb_cfg & ~DVP_SCCB_BYTE_NUM_MASK;
    current |= DVP_SCCB_BYTE_NUM_3;
    dvp->sccb_cfg = current;

    dvp->sccb_ctl = (uint32_t)DVP_SCCB_WRITE_DATA_ENABLE | (uint32_t)DVP_SCCB_DEVICE_ADDRESS(address) | (uint32_t)DVP_SCCB_REG_ADDRESS(location) | (uint32_t)DVP_SCCB_WDATA_BYTE0(data);

// Transfer

    while ((dvp->sts & DVP_STS_SCCB_EN) != 0U) { kern_suspendProcess(1U); }
    dvp->sts = DVP_STS_SCCB_EN | DVP_STS_SCCB_EN_WE;
    while ((dvp->sts & DVP_STS_SCCB_EN) != 0U) { kern_suspendProcess(1U); }
}

static  void    local_initOV2640(const cnfImgk_t *configure) {
    uint16_t    i;

    UNUSED(configure);

    for (i = 0U; i < (uint16_t)KNBCNF; i++) {
        local_sendData(KOV2640A, aOV2640_Cnf[i].oRegNumber, aOV2640_Cnf[i].oValue);
    }
}
